app/Controllers/Home.php

    public function index()
    {
        $keyword  = $this->request->getGet('q');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->makananModel->orderBy('id', 'DESC');

        if (!empty($keyword)) {
            $builder = $builder->groupStart()
                ->like('nama_makanan', $keyword)
                ->orLike('kategori', $keyword)
                ->groupEnd();
        }

        if (!empty($kategori)) {
            $builder = $builder->where('kategori', $kategori);
        }

        $data = [
            'title'         => 'Warung Nusantara - Pesan Makanan Favoritmu',
            'makanan'       => $builder->findAll(),
---
SELECT *
FROM `makanan`
ORDER BY `id` DESC