app/Controllers/MakananController.php

SELECT *
FROM `makanan`
ORDER BY `id` DESC
---
    public function index()
    {
        $keyword   = $this->request->getGet('q');
        $role      = session()->get('role');
        $userId    = session()->get('user_id');
        // Admin melihat semua produk, penjual hanya melihat produk miliknya sendiri.
        $ownerOnly = $role === 'penjual' ? $userId : null;

        if (!empty($keyword)) {
            $makanan = $this->makananModel->cari($keyword, $ownerOnly);
        } else {
            $builder = $this->makananModel->orderBy('id', 'DESC');
            if ($ownerOnly !== null) {
                $builder = $builder->where('user_id', $ownerOnly);
            }
            $makanan = $builder->findAll();

SELECT *
FROM `makanan`
WHERE `makanan`.`id` = '2'
DELETE FROM `makanan`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $makanan = $this->makananModel->find($id);

        if (!$makanan) {
            return redirect()->to('/makanan')->with('gagal', 'Data makanan tidak ditemukan.');
        }

        if ($this->tolakJikaBukanPemilik($makanan)) {
            return redirect()->to('/makanan')->with('gagal', 'Anda tidak berhak menghapus produk milik penjual lain.');
        }

        if (!empty($makanan['gambar']) && file_exists(FCPATH . 'uploads/makanan/' . $makanan['gambar'])) {
            unlink(FCPATH . 'uploads/makanan/' . $makanan['gambar']);
        }

        $this->makananModel->delete($id);