app/Models/MakananModel.php

    public function getKategoriList()
    {
        return $this->distinct()->select('kategori')->orderBy('kategori', 'ASC')->findAll();
---
SELECT DISTINCT `kategori`
FROM `makanan`
ORDER BY `kategori` ASC