app/Models/UserModel.php

INSERT INTO `users` (`nama`, `username`, `email`, `password`, `role`, `no_hp`, `created_at`, `updated_at`) VALUES ('B_Abdil Aziz', 'abdil', 'abdilaziz98826@gmail.com', '$2y$10$hXBwqfe9v7f2yAZXEWHtSOwrTsRfUGztpEZcpeu7ruXbgyEoxrfBK', 'pembeli', '0899888', '2026-07-24 09:45:52', '2026-07-24 09:45:52')
---
    public function daftarkan(array $data)
    {
        if (isset($data['password'])) {
            $data['password'] = password_hash($data['password'], PASSWORD_DEFAULT);
        }

        return $this->insert($data);

SELECT *
FROM `users`
WHERE   (
`username` = 'abdil'
OR `email` = 'abdil'
 )
 LIMIT 1
---
    public function cariByUsernameAtauEmail(string $identitas)
    {
        return $this->groupStart()
            ->where('username', $identitas)
            ->orWhere('email', $identitas)
            ->groupEnd()
            ->first();